"""
# 练习：
# 假设现在有10个学生的成绩，需要录入系统。
# 这些人分别是，张三，李四，王麻子，小影，亚索，梦魇，刀妹，剑姬,皇子，王子
# 并且名字和成绩对应上
# 而且大于60和小于60的分开存放
"""
#----------------------------------------------------------------------------
"""
# gao = {}                   #定义一个空字典，储存大于60分的人
# di = {}                    #定义一个空字典，储存小于60分的人
# xuesheng = ["张三","李四","王麻子","小影","亚索","梦魇","刀妹","剑姬","皇子","王子"]   #定义一个数组，储存人物姓名
# a = 0                       #定义了一个变量，用来控制数组的下标变化
# while a < len(xuesheng):     #因为所有人的向欧盟西欧的录入，都要用到input，所有写了循环，len判断数组了数组的长度，总长度-1就是最大的下标
#      chengji = int(input("请输入"+xuesheng[a]+"的成绩:"))     #录入信息，为了方便判断，所以转换了格式
#      if chengji >= 60:    #判断分数
#           gao[xuesheng[a]] = chengji    #存在字典中
#      else: 
#           di[xuesheng[a]] = chengji 
#      a = a+1             #控制下标变化，每一次循环都+1
# print("大于60分的",gao)
# print("小于60分的",di )
"""



#   for循环

gao = {}                   #定义一个空字典，储存大于60分的人
di = {}                    #定义一个空字典，储存小于60分的人
xuesheng = ["张三","李四","王麻子","小影","亚索","梦魇","刀妹","剑姬","皇子","王子"]   #定义一个数组，储存人物姓名
for i in  xuesheng:     #因为所有人的向欧盟西欧的录入，都要用到input，所有写了循环，len判断数组了数组的长度，总长度-1就是最大的下标
     chengji = int(input("请输入"+i+"的成绩:"))     #录入信息，为了方便判断，所以转换了格式
     if chengji >= 60:    #判断分数
          gao[i] = chengji    #存在字典中
     else: 
          di[i] = chengji 
print("大于60分的",gao)
print("小于60分的",di )



"""
练习：
输出一个九九乘法表
"""

for i in range(1,10):
     for j in range(1,i+1):
         print(i,"X",j,"=",i*j,end="  ")
     print()

   

